// A0 단어장 리스트
List<String> A0_word_list_page = [
  'A0 part1 (1-30)',
  'A0 part2 (31-60)',
  'A0 part3 (61-97)'
];
// A0 단어장 각 단원 범위
List<List<int>> A0_word_list_scale = [
  [1, 30],
  [31, 60],
  [61, 97]
];

// A1 단어장 리스트
List<String> A1_word_list_page = [
  'A1 part1 (1-30)',
  'A1 part2 (31-60)',
  'A1 part3 (61-90)',
  'A1 part4 (91-120)',
  'A1 part5 (121-150)',
  'A1 part6 (151-180)',
  'A1 part7 (181-210)',
  'A1 part8 (211-240)',
  'A1 part9 (241-270)',
  'A1 part10 (271-300)',
  'A1 part11 (301-330)',
  'A1 part12 (331-360)',
  'A1 part13 (361-390)',
  'A1 part14 (391-420)',
  'A1 part15 (421-450)',
  'A1 part16 (451-480)',
  'A1 part17 (481-510)',
  'A1 part18 (511-540)',
  'A1 part19 (541-570)',
  'A1 part20 (571-600)',
  'A1 part21 (601-630)',
  'A1 part22 (631-660)',
  'A1 part23 (661-690)',
  'A1 part24 (691-720)',
  'A1 part25 (721-743)',
];

// A1 단어장 각 단원 범위
List<List<int>> A1_word_list_scale = [
  [1, 30],
  [31, 60],
  [61, 90],
  [91, 120],
  [121, 150],
  [151, 180],
  [181, 210],
  [211, 240],
  [241, 270],
  [271, 300],
  [301, 330],
  [331, 360],
  [361, 390],
  [391, 420],
  [421, 450],
  [451, 480],
  [481, 510],
  [511, 540],
  [541, 570],
  [571, 600],
  [601, 630],
  [631, 660],
  [661, 690],
  [691, 720],
  [721, 743]
];

// A2 단어장 리스트
List<String> A2_word_list_page = [
  'A2 part1 (1-30)',
  'A2 part2 (31-60)',
  'A2 part3 (61-90)',
  'A2 part4 (91-120)',
  'A2 part5 (121-150)',
  'A2 part6 (151-180)',
  'A2 part7 (181-210)',
  'A2 part8 (211-240)',
  'A2 part9 (241-270)',
  'A2 part10 (271-300)',
  'A2 part11 (301-330)',
  'A2 part12 (331-360)',
  'A2 part13 (361-390)',
  'A2 part14 (391-420)',
  'A2 part15 (421-450)',
  'A2 part16 (451-480)',
  'A2 part17 (481-510)',
  'A2 part18 (511-540)',
  'A2 part19 (541-570)',
  'A2 part20 (571-600)',
  'A2 part21 (601-630)',
  'A2 part22 (631-660)',
  'A2 part23 (661-690)',
  'A2 part24 (691-720)',
  'A2 part25 (721-750)',
  'A2 part26 (751-780)',
  'A2 part27 (781-810)',
  'A2 part28 (811-840)',
  'A2 part29 (841-870)',
  'A2 part30 (871-891)',
];

// A2 단어장 각 단원 범위
List<List<int>> A2_word_list_scale = [
  [1, 30],
  [31, 60],
  [61, 90],
  [91, 120],
  [121, 150],
  [151, 180],
  [181, 210],
  [211, 240],
  [241, 270],
  [271, 300],
  [301, 330],
  [331, 360],
  [361, 390],
  [391, 420],
  [421, 450],
  [451, 480],
  [481, 510],
  [511, 540],
  [541, 570],
  [571, 600],
  [601, 630],
  [631, 660],
  [661, 690],
  [691, 720],
  [721, 750],
  [751, 780],
  [781, 810],
  [811, 840],
  [841, 870],
  [871, 891],

];

// B1 단어장 리스트
List<String> B1_word_list_page = [
  'B1 part1 (1-30)',
  'B1 part2 (31-60)',
  'B1 part3 (61-90)',
  'B1 part4 (91-120)',
  'B1 part5 (121-150)',
  'B1 part6 (151-180)',
  'B1 part7 (181-210)',
  'B1 part8 (211-240)',
  'B1 part9 (241-270)',
  'B1 part10 (271-300)',
  'B1 part11 (301-330)',
  'B1 part12 (331-360)',
  'B1 part13 (361-390)',
  'B1 part14 (391-420)',
  'B1 part15 (421-450)',
  'B1 part16 (451-480)',
  'B1 part17 (481-510)',
  'B1 part18 (511-540)',
  'B1 part19 (541-570)',
  'B1 part20 (571-600)',
  'B1 part21 (601-630)',
  'B1 part22 (631-660)',
  'B1 part23 (661-690)',
  'B1 part24 (691-720)',
  'B1 part25 (721-750)',
  'B1 part26 (751-780)',
  'B1 part27 (781-810)',
  'B1 part28 (811-840)',
  'B1 part29 (841-870)',
  'B1 part30 (871-900)',
  'B1 part31 (901-930)',
  'B1 part32 (931-960)',
  'B1 part33 (961-990)',
  'B1 part34 (991-1020)',
  'B1 part35 (1021-1050)',
  'B1 part36 (1051-1080)',
  'B1 part37 (1081-1110)',
  'B1 part38 (1111-1140)',
  'B1 part39 (1141-1174)',
];

// B1 단어장 각 단원 범위
List<List<int>> B1_word_list_scale = [
  [1, 30],
  [31, 60],
  [61, 90],
  [91, 120],
  [121, 150],
  [151, 180],
  [181, 210],
  [211, 240],
  [241, 270],
  [271, 300],
  [301, 330],
  [331, 360],
  [361, 390],
  [391, 420],
  [421, 450],
  [451, 480],
  [481, 510],
  [511, 540],
  [541, 570],
  [571, 600],
  [601, 630],
  [631, 660],
  [661, 690],
  [691, 720],
  [721, 750],
  [751, 780],
  [781, 810],
  [811, 840],
  [841, 870],
  [871, 900],
  [901, 930],
  [931, 960],
  [961, 990],
  [991, 1020],
  [1021, 1050],
  [1051, 1080],
  [1081, 1110],
  [1111, 1140],
  [1141, 1172]
];

//초급 문법 단어 리스트
List<String> elementary_grammar_word_list_page = [

  '초급 문법 1,2과',
  '초급 문법 3과-1',
  '초급 문법 3과-2',
  '초급 문법 4과',
  '초급 문법 5과',
  '초급 문법 6과',
  '초급 문법 7과',
  '초급 문법 8과',
  '초급 문법 9과',
  '초급 문법 10과',
  '초급 문법 11과',
  '초급 문법 12과',
  '초급 문법 13과',
  '초급 문법 14과',
  '초급 문법 15과',
  '초급 문법 16과',
  '초급 문법 17과',
  '초급 문법 18과',
  '초급 문법 19과',
  '초급 문법 20과',
  '초급 문법 21과',
  '초급 문법 22과',
  '초급 문법 23과',
  '초급 문법 24과'


];

//초급 문법 각 단원 범위
List<List<int>> elementary_grammar_word_list_scale = [

  //elementary_hindi_book(1~3).xlsx
  [1,31],
  [32,61],
  [62,95],
  //elementary_hindi_book(4~5).xlsx
  [1,53],
  [54,104],
  //elementary_hindi_book(6~8).xlsx
  [1,22],
  [23,56],
  [57,98],
  //elementary_hindi_book(9~10).xlsx
  [1,46],
  [47,80],
  //elementary_hindi_book(11~14).xlsx
  [1,24],
  [25,53],
  [54,71],
  [72,94],
  //elementary_hindi_book(15~19).xlsx
  [1,16],
  [17,43],
  [44,59],
  [60,85],
  [86,125],
  //elementary_hindi_book(20~21).xlsx
  [1,40],
  [41,93],
  //elementary_hindi_book(22~24).xlsx
  [1,42],
  [43,85],
  [86,111]


];

//중 문법 단어 리스트
List<String> middle_grammar_word_list_page = [
  '중급 문법 1과',
  '중급 문법 2과',
  '중급 문법 3과',
  '중급 문법 4과',
  '중급 문법 5~7과',
  '중급 문법 8과',
  '중급 문법 9~11과',
  '중급 문법 12과',
  '중급 문법 13~15과',
  '중급 문법 16~17과',
  '중급 문법 18~21과',
  '중급 문법 22~23과',
  '중급 문법 24과',
  '중급 문법 25과',
  '중급 문법 26~29과',
  '중급 문법 30~33과',
  '중급 문법 34~36과',
  '중급 문법 37~40과',
  '중급 문법 41~43과',
  '중급 문법 44과',
  '중급 문법 45~46과',
  '중급 문법 47과',
  '중급 문법 48~49과'








];

//중급 문법 각 단원 범위
List<List<int>> middle_grammar_word_list_scale =[






  //middle_hindi_book(1~4).xlsx
  [1,47],
  [48,68],
  [69,81],
  [82,95],
  //middle_hindi_book(5~15).xlsx
  [1,19],
  [20,48],
  [49,62],
  [63,88],
  [89,107],
  // middle_hindi_book(16~24).xlsx
  [1,29],
  [30,51],
  [52,69],
  [70,103],
  //middle_hindi_book(25~33).xlsx
  [1,39],
  [40,64],
  [65,106],
  //middle_hindi_book(34~43).xlsx
  [1,34],
  [35,61],
  [62,102],
  //middle_hindi_book(44~49).xlsx
  [1,24],
  [25,43],
  [44,76],
  [77,91]








];